#
#
#
# lst ='😇🤬😂🤣😊😇👿😸☠👽😻🤖🤠😵😲😑😐😶😦😯🙄🤫🤥😰😨😱😳🤯😭😤😠🤬😩😫'
# emos = list(lst)
# print(emos)

# 0[[   ]['x'][   ]['x'][   ]['x'][   ]['x'][   ]['x'][   ]['x']['x']['x']['x']]
# 1[['x'][   ]['x']['x'][   ]['x']['x'][   ]['x']['x'][   ]['x']['x'][   ][   ]]
# 2[[   ]['x'][   ]['x']['x']['x']['x']['x']['x']['x']['x']['x']['x']['x']['x']]
# 3[[   ][   ]['x']['x'][   ]['x']['x'][   ]['x']['x']['x']['x']['x'][   ][   ]]
# 4[['x'][   ]['x']['x'][   ]['x']['x'][   ]['x']['x'][   ]['x']['x'][   ][   ]]
# 5[[   ]['x'][   ]['x'][   ]['x']['x'][   ]['x']['x'][   ]['x']['x']['x']['x']]
#     0                                                                     14
print(stupid_idea)
#   0                                         14
name = 'shane'
letters = list(name)
print(letters)
lst = [(0,0,False)]
alpha_dict = dict(zip(letters, lst))
print(alpha_dict)

